
# Messages
START_MESSAGE = 'Здравствуйте. Данный бот прогнозирует уровень воды по постам '\
                'гидрологического контроля на реках Подкаменная Тунгуска и ' \
                'Нижняя Тунгуска. Обучение проводилось на метео-данных ' \
                'наблюдений уровней воды, которые были собраны за период с ' \
                '2008 по 2017 года.'

INVALID_DATA_MESSAGE = 'Вы выбрали выбрали значения в обход бота. ' \
                       'Пожалуйста, попробуйте ещё раз: /start'

PREDICT_MESSAGE = 'Вы выбрали:\n пост №{}, период {}-{}\n\n' \
                  'Для повтора запустите команду /start'

# Prompts
SELECT_POST = 'Пожалуйста, выберите пункт наблюдения:'
SELECT_YEAR = 'Теперь выберите год, за который нужно получить ' \
                      'предсказания:'
SELECT_MONTH = 'Выберите месяц:'


# Placeholders
SELECT_YEAR_PLACEHOLDER = 'Выберите год:'

# Labels
WATER_LEVEL = 'Уровень воды, см.'

